              88 FOUND-CUST-IN-MSTR                VALUE 'Y'.                   
              88 NFOUND-CUST-IN-MSTR               VALUE 'N'.                   
           05 WS-PAUT-SMRY-SEG-FLG       PIC X(1).                              
              88 FOUND-PAUT-SMRY-SEG               VALUE 'Y'.                   
              88 NFOUND-PAUT-SMRY-SEG              VALUE 'N'.                   
           05 WS-ERR-FLG                 PIC X(1)  VALUE 'N'.                   
              88 ERR-FLG-ON                        VALUE 'Y'.                   
              88 ERR-FLG-OFF                       VALUE 'N'.                   
           05 WS-AUTHS-EOF               PIC X(1)  VALUE 'N'.                   
              88 AUTHS-EOF                         VALUE 'Y'.                   
              88 AUTHS-NOT-EOF                     VALUE 'N'.                   
