         05 WS-ERR-FLG                 PIC X(01) VALUE 'N'.             00450026
           88 ERR-FLG-ON                         VALUE 'Y'.             00460026
