          05 IMS-RETURN-CODE                 PIC X(02).                 00690026
             88 STATUS-OK                    VALUE '  ', 'FW'.          00700026
