          05 FILLER                 PIC X(01) VALUE ' '.                00832053
      *                                                                 00832153
