       FILE-CONTROL.                                                    00090026
           SELECT INFILE1 ASSIGN TO INFILE1                             00100053
