       01 WS-VARIABLES.                                                         
         05 WS-PGM-AUTH                PIC X(08)  VALUE 'COPAUA0C'.             
