         05 WS-CICS-TRANID             PIC X(04)  VALUE 'CP00'.                 
         05 WS-ACCTFILENAME            PIC X(8)   VALUE 'ACCTDAT '.             
         05 WS-CUSTFILENAME            PIC X(8)   VALUE 'CUSTDAT '.             
         05 WS-CARDFILENAME            PIC X(8)   VALUE 'CARDDAT '.             
         05 WS-CARDFILENAME-ACCT-PATH  PIC X(8)   VALUE 'CARDAIX '.             
         05 WS-CCXREF-FILE             PIC X(08)  VALUE 'CCXREF  '.             
         05 WS-REQSTS-PROCESS-LIMIT    PIC S9(4)  COMP VALUE 500.               
                                                                                
