         05 WS-REQUEST-QNAME           PIC X(48).                               
         05 WS-REPLY-QNAME             PIC X(48).                               
